![banner_ey.jpg](attachment:banner_ey.jpg)

## Manual de ejercicios parte 4

In [3]:
%load_ext rpy2.ipython
#!rm -rf RiesgosFinancieros
!git clone "https://github.com/pikey-msc/Typhon_YE/"

The rpy2.ipython extension is already loaded. To reload it, use:
  %reload_ext rpy2.ipython
Cloning into 'Typhon_YE'...
remote: Enumerating objects: 36, done.
remote: Counting objects: 100% (36/36), done.
remote: Compressing objects: 100% (36/36), done.
remote: Total 36 (delta 8), reused 0 (delta 0), pack-reused 0
Unpacking objects: 100% (36/36), done.

### 1. Descargar base de datos del titanic

Solución

In [6]:
import pandas as pd
import numpy as np

data=pd.read_csv('Typhon_YE/Sesion 4/Titanic.csv')
data.head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

### 2. ¿Cuántos hombres y cuántas mujeres viajaban en el titanic?

Solución

In [14]:
data.groupby('Sex').agg(['count'])

       PassengerId Survived Pclass  Name  ... Ticket  Fare Cabin Embarked
             count    count  count count  ...  count count count    count
Sex                                       ...
female         314      314    314   314  ...    314   314    97      312
male           577      577    577   577  ...    577   577   107      577

[2 rows x 11 columns]

### 3. ¿Cuántos pasajeros sobrevivieron?

Solucion

In [17]:
sum(data.Survived)
print(sum(data.Survived)/len(data.PassengerId))

0.3838383838383838

### 4. ¿Cuántos pasajeros de cada sexo sobrevivieron?

Solución

In [18]:
data[data.Survived==1].groupby('Sex').agg(['count'])

       PassengerId Survived Pclass  Name  ... Ticket  Fare Cabin Embarked
             count    count  count count  ...  count count count    count
Sex                                       ...
female         233      233    233   233  ...    233   233    91      231
male           109      109    109   109  ...    109   109    45      109

[2 rows x 11 columns]

### 5. ¿Cuántos pasajeros menores de edad viajaban?

Solución

In [19]:
len(data.Age<18)

891

### 6. ¿Quién es el pasajero de mayor edad y quién es el pasajero de menor edad?

Solución

In [24]:
print(data[data.Age==np.max(data.Age)].Name,data[data.Age==np.max(data.Age)].Age)

print(data[data.Age==np.min(data.Age)].Name,data[data.Age==np.min(data.Age)].Age)

630    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object 630    80.0
Name: Age, dtype: float64
803    Thomas, Master. Assad Alexander
Name: Name, dtype: object 803    0.42
Name: Age, dtype: float64